{
 "admins": {
  "title": "Admins do CCM",
  "description": "Os servidores <i>web</i> e a sala de computação do CCM são administrados por alunos do próprio curso.\r\n",
  "intro": "Os admins são os alunos responsáveis pela manutenção e melhoramento dos recursos computacionais disponíveis aos alunos do CCM - em particular, os computadores pró-aluno da sala de computação e os dois servidores da sala (proccm, hub interno para autenticação da sala pró-aluno, e fleming, servidor web que hosteia a wiki e páginas como essa).\r\n<br><br>\r\nA sala Linux do CCM (primeiro no Favo, e agora no Inova) é uma das mais antigas da USP, e foi tradicionalmente gerida por alunos, então estamos sempre buscando pessoas interessadas em computação e software livre para manter essa tradição.",
  "sections": [
   [
    "Qual o benefício de ser admin?",
    "Monetáriamente, o CCM atualmente oferece duas bolsas de 700 reais mensais para monitores da sala pró-aluno, que são priorizadas para admins da sala. Acadêmicamente, trabalhar como admin dá uma base ótima em aspectos essenciais da computação que não costumam ser cobertos na estrada de ouro de Computação I - IV: coisas como protocolos de rede, sistemas operacionais, hardware, sem falar do conhecimento prático envolvido em manter uma rede de computadores funcionando.\r\n<br><br>\r\nAlém disso, a liberdade concedida à nossa sala permite que admins (ou até alunos normais, sob tutela de admins) desenvolvam qualquer projeto que seja de seu interesse usando os recursos computacionais da sala. Assim, você pode usar os recursos da sala como laboratório de criação de páginas web, bancos de dados, programação embarcada... Só depende de você."
   ],
   [
    "Como posso virar admin?",
    "Esperamos algum nível de conforto com o ecossistema Linux (particularmente terminal) e com os específicos da nossa sala de computação antes de aceitar alguém como admin, só para garantir que a pessoa não vai cometer erros básicos graves com acesso administrativo. A \"prova\" para checar esse conhecimento é <a href=\"http://wiki.cecm.usp.br/wiki/index.php/Configurando_um_PC_da_rede_proaluno\">saber configurar um PC da sala do zero</a>, entendendo cada um dos passos (pode consultar a página acima e outras documentações, óbvio).\r\n<br><br>\r\nPara adquirir essa base, recomendamos dar uma lida na <a href=\"http://wiki.cecm.usp.br/wiki/index.php/Guia_de_Sobreviv%C3%AAncia_Molecular_dos_Admins\">nossa wiki</a> (um pouco desatualizada), na <a href=\"https://wiki.archlinux.org/\">ArchWiki</a> (wiki com informações gerais sobre Linux, mas particularmente pro Arch) e no <a href=\"https://overthewire.org/wargames/bandit/\">Bandit</a> (joguinho que te dá maior conforto em linha de comando). Também sinta-se livre para contatar os admins com dúvidas."
   ]
  ],
  "students": [
   [
    "joel.png",
    "Joel Soares (<a href=\"mailto:joelsm@usp.br\">joelsm@usp.br</a>)"
   ]
  ],
  "links": [
   [
    "https://wiki.archlinux.org",
    "ArchWiki"
   ],
   [
    "http://wiki.cecm.usp.br/wiki/index.php/Guia_de_Sobreviv%C3%AAncia_Molecular_dos_Admins",
    "Wikoleculares"
   ],
   [
    "https://overthewire.org/wargames/bandit",
    "Wargames"
   ],
   [
    "https://linux.ime.usp.br/",
    "Rede Linux IME"
   ],
   [
    "https://ccsl.ime.usp.br/pt-br/",
    "Software Livre USP"
   ],
   [
    "https://proaluno.fflch.usp.br/linux-na-pro-aluno",
    "Rede Linux FFLCH"
   ]
  ]
 }
}